leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxInt_bf.h
/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN18 */
#define IFX_INT_ACCEN10_EN18_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN18 */
#define IFX_INT_ACCEN10_EN18_OFF (18u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN19 */
#define IFX_INT_ACCEN10_EN19_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN19 */
#define IFX_INT_ACCEN10_EN19_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN19 */
#define IFX_INT_ACCEN10_EN19_OFF (19u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN1 */
#define IFX_INT_ACCEN10_EN1_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN1 */
#define IFX_INT_ACCEN10_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN1 */
#define IFX_INT_ACCEN10_EN1_OFF (1u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN20 */
#define IFX_INT_ACCEN10_EN20_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN20 */
#define IFX_INT_ACCEN10_EN20_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN20 */
#define IFX_INT_ACCEN10_EN20_OFF (20u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN21 */
#define IFX_INT_ACCEN10_EN21_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN21 */
#define IFX_INT_ACCEN10_EN21_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN21 */
#define IFX_INT_ACCEN10_EN21_OFF (21u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN22 */
#define IFX_INT_ACCEN10_EN22_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN22 */
#define IFX_INT_ACCEN10_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN22 */
#define IFX_INT_ACCEN10_EN22_OFF (22u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN23 */
#define IFX_INT_ACCEN10_EN23_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN23 */
#define IFX_INT_ACCEN10_EN23_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN23 */
#define IFX_INT_ACCEN10_EN23_OFF (23u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN24 */
#define IFX_INT_ACCEN10_EN24_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN24 */
#define IFX_INT_ACCEN10_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN24 */
#define IFX_INT_ACCEN10_EN24_OFF (24u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN25 */
#define IFX_INT_ACCEN10_EN25_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN25 */
#define IFX_INT_ACCEN10_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN25 */
#define IFX_INT_ACCEN10_EN25_OFF (25u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN26 */
#define IFX_INT_ACCEN10_EN26_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN26 */
#define IFX_INT_ACCEN10_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN26 */
#define IFX_INT_ACCEN10_EN26_OFF (26u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN27 */
#define IFX_INT_ACCEN10_EN27_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN27 */
#define IFX_INT_ACCEN10_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN27 */
#define IFX_INT_ACCEN10_EN27_OFF (27u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN28 */
#define IFX_INT_ACCEN10_EN28_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN28 */
#define IFX_INT_ACCEN10_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN28 */
#define IFX_INT_ACCEN10_EN28_OFF (28u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN29 */
#define IFX_INT_ACCEN10_EN29_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN29 */
#define IFX_INT_ACCEN10_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN29 */
#define IFX_INT_ACCEN10_EN29_OFF (29u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN2 */
#define IFX_INT_ACCEN10_EN2_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN2 */
#define IFX_INT_ACCEN10_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN2 */
#define IFX_INT_ACCEN10_EN2_OFF (2u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN30 */
#define IFX_INT_ACCEN10_EN30_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN30 */
#define IFX_INT_ACCEN10_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN30 */
#define IFX_INT_ACCEN10_EN30_OFF (30u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN31 */
#define IFX_INT_ACCEN10_EN31_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN31 */
#define IFX_INT_ACCEN10_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN31 */
#define IFX_INT_ACCEN10_EN31_OFF (31u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN3 */
#define IFX_INT_ACCEN10_EN3_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN3 */
#define IFX_INT_ACCEN10_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN3 */
#define IFX_INT_ACCEN10_EN3_OFF (3u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN4 */
#define IFX_INT_ACCEN10_EN4_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN4 */
#define IFX_INT_ACCEN10_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN4 */
#define IFX_INT_ACCEN10_EN4_OFF (4u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN5 */
#define IFX_INT_ACCEN10_EN5_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN5 */
#define IFX_INT_ACCEN10_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN5 */
#define IFX_INT_ACCEN10_EN5_OFF (5u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN6 */
#define IFX_INT_ACCEN10_EN6_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN6 */
#define IFX_INT_ACCEN10_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN6 */
#define IFX_INT_ACCEN10_EN6_OFF (6u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN7 */
#define IFX_INT_ACCEN10_EN7_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN7 */
#define IFX_INT_ACCEN10_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN7 */
#define IFX_INT_ACCEN10_EN7_OFF (7u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN8 */
#define IFX_INT_ACCEN10_EN8_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN8 */
#define IFX_INT_ACCEN10_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN8 */
#define IFX_INT_ACCEN10_EN8_OFF (8u)

/** \brief  Length for Ifx_INT_ACCEN10_Bits.EN9 */
#define IFX_INT_ACCEN10_EN9_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN10_Bits.EN9 */
#define IFX_INT_ACCEN10_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN10_Bits.EN9 */
#define IFX_INT_ACCEN10_EN9_OFF (9u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.ECC */
#define IFX_INT_ICU_ECR_ECC_LEN (6u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.ECC */
#define IFX_INT_ICU_ECR_ECC_MSK (0x3fu)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.ECC */
#define IFX_INT_ICU_ECR_ECC_OFF (10u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.EOV */
#define IFX_INT_ICU_ECR_EOV_LEN (1u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.EOV */
#define IFX_INT_ICU_ECR_EOV_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.EOV */
#define IFX_INT_ICU_ECR_EOV_OFF (30u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.ID */
#define IFX_INT_ICU_ECR_ID_LEN (10u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.ID */
#define IFX_INT_ICU_ECR_ID_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.ID */
#define IFX_INT_ICU_ECR_ID_OFF (16u)

