leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxInt_bf.h
/** \brief  Length for Ifx_INT_ICU_ECR_Bits.PN */
#define IFX_INT_ICU_ECR_PN_LEN (8u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.PN */
#define IFX_INT_ICU_ECR_PN_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.PN */
#define IFX_INT_ICU_ECR_PN_OFF (0u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.STAT */
#define IFX_INT_ICU_ECR_STAT_LEN (1u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.STAT */
#define IFX_INT_ICU_ECR_STAT_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.STAT */
#define IFX_INT_ICU_ECR_STAT_OFF (31u)

/** \brief  Length for Ifx_INT_ICU_LASR_Bits.ECC */
#define IFX_INT_ICU_LASR_ECC_LEN (6u)

/** \brief  Mask for Ifx_INT_ICU_LASR_Bits.ECC */
#define IFX_INT_ICU_LASR_ECC_MSK (0x3fu)

/** \brief  Offset for Ifx_INT_ICU_LASR_Bits.ECC */
#define IFX_INT_ICU_LASR_ECC_OFF (10u)

/** \brief  Length for Ifx_INT_ICU_LASR_Bits.ID */
#define IFX_INT_ICU_LASR_ID_LEN (10u)

/** \brief  Mask for Ifx_INT_ICU_LASR_Bits.ID */
#define IFX_INT_ICU_LASR_ID_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_ICU_LASR_Bits.ID */
#define IFX_INT_ICU_LASR_ID_OFF (16u)

/** \brief  Length for Ifx_INT_ICU_LASR_Bits.PN */
#define IFX_INT_ICU_LASR_PN_LEN (8u)

/** \brief  Mask for Ifx_INT_ICU_LASR_Bits.PN */
#define IFX_INT_ICU_LASR_PN_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ICU_LASR_Bits.PN */
#define IFX_INT_ICU_LASR_PN_OFF (0u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.ECC */
#define IFX_INT_ICU_LWSR_ECC_LEN (6u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.ECC */
#define IFX_INT_ICU_LWSR_ECC_MSK (0x3fu)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.ECC */
#define IFX_INT_ICU_LWSR_ECC_OFF (10u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.ID */
#define IFX_INT_ICU_LWSR_ID_LEN (10u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.ID */
#define IFX_INT_ICU_LWSR_ID_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.ID */
#define IFX_INT_ICU_LWSR_ID_OFF (16u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.PN */
#define IFX_INT_ICU_LWSR_PN_LEN (8u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.PN */
#define IFX_INT_ICU_LWSR_PN_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.PN */
#define IFX_INT_ICU_LWSR_PN_OFF (0u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.STAT */
#define IFX_INT_ICU_LWSR_STAT_LEN (1u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.STAT */
#define IFX_INT_ICU_LWSR_STAT_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.STAT */
#define IFX_INT_ICU_LWSR_STAT_OFF (31u)

/** \brief  Length for Ifx_INT_ID_Bits.MODNUMBER */
#define IFX_INT_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_INT_ID_Bits.MODNUMBER */
#define IFX_INT_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_ID_Bits.MODNUMBER */
#define IFX_INT_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_INT_ID_Bits.MODREV */
#define IFX_INT_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_INT_ID_Bits.MODREV */
#define IFX_INT_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ID_Bits.MODREV */
#define IFX_INT_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_INT_ID_Bits.MODTYPE */
#define IFX_INT_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_INT_ID_Bits.MODTYPE */
#define IFX_INT_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ID_Bits.MODTYPE */
#define IFX_INT_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_LEN (1u)

/** \brief  Mask for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_MSK (0x1u)

/** \brief  Offset for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_OFF (7u)

/** \brief  Length for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_LEN (1u)

/** \brief  Mask for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_OFF (15u)

/** \brief  Length for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_LEN (2u)

/** \brief  Mask for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_OFF (0u)

/** \brief  Length for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_LEN (2u)

/** \brief  Mask for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_OFF (8u)

/** \brief  Length for Ifx_INT_OIXMS_Bits.MIRQ */
#define IFX_INT_OIXMS_MIRQ_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXMS_Bits.MIRQ */
#define IFX_INT_OIXMS_MIRQ_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXMS_Bits.MIRQ */
#define IFX_INT_OIXMS_MIRQ_OFF (0u)

/** \brief  Length for Ifx_INT_OIXS0_Bits.IRQ0 */
#define IFX_INT_OIXS0_IRQ0_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS0_Bits.IRQ0 */
#define IFX_INT_OIXS0_IRQ0_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS0_Bits.IRQ0 */
#define IFX_INT_OIXS0_IRQ0_OFF (0u)

/** \brief  Length for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_OFF (16u)

/** \brief  Length for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_OFF (0u)

/** \brief  Length for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_OFF (16u)

/** \brief  Length for Ifx_INT_OIXTS_Bits.OBS */
#define IFX_INT_OIXTS_OBS_LEN (2u)

/** \brief  Mask for Ifx_INT_OIXTS_Bits.OBS */
#define IFX_INT_OIXTS_OBS_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OIXTS_Bits.OBS */
#define IFX_INT_OIXTS_OBS_OFF (8u)

/** \brief  Length for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_LEN (2u)

/** \brief  Mask for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_OFF (0u)

